7767517
199 215
Input            input                    0 1 input
Convolution      333                      1 1 input 333 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=648
BatchNorm        334                      1 1 333 334 0=24
ReLU             335                      1 1 334 335 0=1.000000e-01
Pooling          336                      1 1 335 336 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 336 336_splitncnn_0 336_splitncnn_1
ConvolutionDepthWise 337                      1 1 336_splitncnn_1 337 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=216 7=24
BatchNorm        338                      1 1 337 338 0=24
Convolution      339                      1 1 338 339 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1392
BatchNorm        340                      1 1 339 340 0=58
ReLU             341                      1 1 340 341 0=1.000000e-01
Convolution      342                      1 1 336_splitncnn_0 342 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1392
BatchNorm        343                      1 1 342 343 0=58
ReLU             344                      1 1 343 344 0=1.000000e-01
ConvolutionDepthWise 345                      1 1 344 345 0=58 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        346                      1 1 345 346 0=58
Convolution      347                      1 1 346 347 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        348                      1 1 347 348 0=58
ReLU             349                      1 1 348 349 0=1.000000e-01
Concat           350                      2 1 341 349 350 0=0
ShuffleChannel   355                      1 1 350 355 0=2 1=0
Slice            356                      1 2 355 356 357 -23300=2,58,-233 1=0
Convolution      358                      1 1 357 358 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        359                      1 1 358 359 0=58
ReLU             360                      1 1 359 360 0=1.000000e-01
ConvolutionDepthWise 361                      1 1 360 361 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        362                      1 1 361 362 0=58
Convolution      363                      1 1 362 363 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        364                      1 1 363 364 0=58
ReLU             365                      1 1 364 365 0=1.000000e-01
Concat           366                      2 1 356 365 366 0=0
ShuffleChannel   371                      1 1 366 371 0=2 1=0
Slice            372                      1 2 371 372 373 -23300=2,58,-233 1=0
Convolution      374                      1 1 373 374 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        375                      1 1 374 375 0=58
ReLU             376                      1 1 375 376 0=1.000000e-01
ConvolutionDepthWise 377                      1 1 376 377 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        378                      1 1 377 378 0=58
Convolution      379                      1 1 378 379 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        380                      1 1 379 380 0=58
ReLU             381                      1 1 380 381 0=1.000000e-01
Concat           382                      2 1 372 381 382 0=0
ShuffleChannel   387                      1 1 382 387 0=2 1=0
Slice            388                      1 2 387 388 389 -23300=2,58,-233 1=0
Convolution      390                      1 1 389 390 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        391                      1 1 390 391 0=58
ReLU             392                      1 1 391 392 0=1.000000e-01
ConvolutionDepthWise 393                      1 1 392 393 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        394                      1 1 393 394 0=58
Convolution      395                      1 1 394 395 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        396                      1 1 395 396 0=58
ReLU             397                      1 1 396 397 0=1.000000e-01
Concat           398                      2 1 388 397 398 0=0
ShuffleChannel   403                      1 1 398 403 0=2 1=0
Split            splitncnn_1              1 2 403 403_splitncnn_0 403_splitncnn_1
ConvolutionDepthWise 404                      1 1 403_splitncnn_1 404 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        405                      1 1 404 405 0=116
Convolution      406                      1 1 405 406 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        407                      1 1 406 407 0=116
ReLU             408                      1 1 407 408 0=1.000000e-01
Convolution      409                      1 1 403_splitncnn_0 409 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        410                      1 1 409 410 0=116
ReLU             411                      1 1 410 411 0=1.000000e-01
ConvolutionDepthWise 412                      1 1 411 412 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        413                      1 1 412 413 0=116
Convolution      414                      1 1 413 414 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        415                      1 1 414 415 0=116
ReLU             416                      1 1 415 416 0=1.000000e-01
Concat           417                      2 1 408 416 417 0=0
ShuffleChannel   422                      1 1 417 422 0=2 1=0
Slice            423                      1 2 422 423 424 -23300=2,116,-233 1=0
Convolution      425                      1 1 424 425 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        426                      1 1 425 426 0=116
ReLU             427                      1 1 426 427 0=1.000000e-01
ConvolutionDepthWise 428                      1 1 427 428 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        429                      1 1 428 429 0=116
Convolution      430                      1 1 429 430 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        431                      1 1 430 431 0=116
ReLU             432                      1 1 431 432 0=1.000000e-01
Concat           433                      2 1 423 432 433 0=0
ShuffleChannel   438                      1 1 433 438 0=2 1=0
Slice            439                      1 2 438 439 440 -23300=2,116,-233 1=0
Convolution      441                      1 1 440 441 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        442                      1 1 441 442 0=116
ReLU             443                      1 1 442 443 0=1.000000e-01
ConvolutionDepthWise 444                      1 1 443 444 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        445                      1 1 444 445 0=116
Convolution      446                      1 1 445 446 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        447                      1 1 446 447 0=116
ReLU             448                      1 1 447 448 0=1.000000e-01
Concat           449                      2 1 439 448 449 0=0
ShuffleChannel   454                      1 1 449 454 0=2 1=0
Slice            455                      1 2 454 455 456 -23300=2,116,-233 1=0
Convolution      457                      1 1 456 457 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        458                      1 1 457 458 0=116
ReLU             459                      1 1 458 459 0=1.000000e-01
ConvolutionDepthWise 460                      1 1 459 460 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        461                      1 1 460 461 0=116
Convolution      462                      1 1 461 462 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        463                      1 1 462 463 0=116
ReLU             464                      1 1 463 464 0=1.000000e-01
Concat           465                      2 1 455 464 465 0=0
ShuffleChannel   470                      1 1 465 470 0=2 1=0
Slice            471                      1 2 470 471 472 -23300=2,116,-233 1=0
Convolution      473                      1 1 472 473 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        474                      1 1 473 474 0=116
ReLU             475                      1 1 474 475 0=1.000000e-01
ConvolutionDepthWise 476                      1 1 475 476 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        477                      1 1 476 477 0=116
Convolution      478                      1 1 477 478 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        479                      1 1 478 479 0=116
ReLU             480                      1 1 479 480 0=1.000000e-01
Concat           481                      2 1 471 480 481 0=0
ShuffleChannel   486                      1 1 481 486 0=2 1=0
Slice            487                      1 2 486 487 488 -23300=2,116,-233 1=0
Convolution      489                      1 1 488 489 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        490                      1 1 489 490 0=116
ReLU             491                      1 1 490 491 0=1.000000e-01
ConvolutionDepthWise 492                      1 1 491 492 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        493                      1 1 492 493 0=116
Convolution      494                      1 1 493 494 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        495                      1 1 494 495 0=116
ReLU             496                      1 1 495 496 0=1.000000e-01
Concat           497                      2 1 487 496 497 0=0
ShuffleChannel   502                      1 1 497 502 0=2 1=0
Slice            503                      1 2 502 503 504 -23300=2,116,-233 1=0
Convolution      505                      1 1 504 505 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        506                      1 1 505 506 0=116
ReLU             507                      1 1 506 507 0=1.000000e-01
ConvolutionDepthWise 508                      1 1 507 508 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        509                      1 1 508 509 0=116
Convolution      510                      1 1 509 510 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        511                      1 1 510 511 0=116
ReLU             512                      1 1 511 512 0=1.000000e-01
Concat           513                      2 1 503 512 513 0=0
ShuffleChannel   518                      1 1 513 518 0=2 1=0
Slice            519                      1 2 518 519 520 -23300=2,116,-233 1=0
Convolution      521                      1 1 520 521 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        522                      1 1 521 522 0=116
ReLU             523                      1 1 522 523 0=1.000000e-01
ConvolutionDepthWise 524                      1 1 523 524 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        525                      1 1 524 525 0=116
Convolution      526                      1 1 525 526 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        527                      1 1 526 527 0=116
ReLU             528                      1 1 527 528 0=1.000000e-01
Concat           529                      2 1 519 528 529 0=0
ShuffleChannel   534                      1 1 529 534 0=2 1=0
Split            splitncnn_2              1 2 534 534_splitncnn_0 534_splitncnn_1
ConvolutionDepthWise 535                      1 1 534_splitncnn_1 535 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        536                      1 1 535 536 0=232
Convolution      537                      1 1 536 537 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        538                      1 1 537 538 0=232
ReLU             539                      1 1 538 539 0=1.000000e-01
Convolution      540                      1 1 534_splitncnn_0 540 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        541                      1 1 540 541 0=232
ReLU             542                      1 1 541 542 0=1.000000e-01
ConvolutionDepthWise 543                      1 1 542 543 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        544                      1 1 543 544 0=232
Convolution      545                      1 1 544 545 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        546                      1 1 545 546 0=232
ReLU             547                      1 1 546 547 0=1.000000e-01
Concat           548                      2 1 539 547 548 0=0
ShuffleChannel   553                      1 1 548 553 0=2 1=0
Slice            554                      1 2 553 554 555 -23300=2,232,-233 1=0
Convolution      556                      1 1 555 556 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        557                      1 1 556 557 0=232
ReLU             558                      1 1 557 558 0=1.000000e-01
ConvolutionDepthWise 559                      1 1 558 559 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        560                      1 1 559 560 0=232
Convolution      561                      1 1 560 561 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        562                      1 1 561 562 0=232
ReLU             563                      1 1 562 563 0=1.000000e-01
Concat           564                      2 1 554 563 564 0=0
ShuffleChannel   569                      1 1 564 569 0=2 1=0
Slice            570                      1 2 569 570 571 -23300=2,232,-233 1=0
Convolution      572                      1 1 571 572 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        573                      1 1 572 573 0=232
ReLU             574                      1 1 573 574 0=1.000000e-01
ConvolutionDepthWise 575                      1 1 574 575 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        576                      1 1 575 576 0=232
Convolution      577                      1 1 576 577 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        578                      1 1 577 578 0=232
ReLU             579                      1 1 578 579 0=1.000000e-01
Concat           580                      2 1 570 579 580 0=0
ShuffleChannel   585                      1 1 580 585 0=2 1=0
Slice            586                      1 2 585 586 587 -23300=2,232,-233 1=0
Convolution      588                      1 1 587 588 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        589                      1 1 588 589 0=232
ReLU             590                      1 1 589 590 0=1.000000e-01
ConvolutionDepthWise 591                      1 1 590 591 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        592                      1 1 591 592 0=232
Convolution      593                      1 1 592 593 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        594                      1 1 593 594 0=232
ReLU             595                      1 1 594 595 0=1.000000e-01
Concat           596                      2 1 586 595 596 0=0
ShuffleChannel   601                      1 1 596 601 0=2 1=0
Pooling          602                      1 1 601 602 0=1 4=1
Flatten          603                      1 1 602 603
InnerProduct     output                   1 1 603 output 0=28 1=1 2=12992
