7767517
204 220
Input            input                    0 1 input
Convolution      347                      1 1 input 347 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=648
BatchNorm        348                      1 1 347 348 0=24
ReLU             349                      1 1 348 349 0=1.000000e-01
Pooling          350                      1 1 349 350 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 350 350_splitncnn_0 350_splitncnn_1
ConvolutionDepthWise 351                      1 1 350_splitncnn_1 351 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=216 7=24
BatchNorm        352                      1 1 351 352 0=24
Convolution      353                      1 1 352 353 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1392
BatchNorm        354                      1 1 353 354 0=58
ReLU             355                      1 1 354 355 0=1.000000e-01
Convolution      356                      1 1 350_splitncnn_0 356 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1392
BatchNorm        357                      1 1 356 357 0=58
ReLU             358                      1 1 357 358 0=1.000000e-01
ConvolutionDepthWise 359                      1 1 358 359 0=58 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        360                      1 1 359 360 0=58
Convolution      361                      1 1 360 361 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        362                      1 1 361 362 0=58
ReLU             363                      1 1 362 363 0=1.000000e-01
Concat           364                      2 1 355 363 364 0=0
ShuffleChannel   369                      1 1 364 369 0=2 1=0
Slice            370                      1 2 369 370 371 -23300=2,58,-233 1=0
Convolution      372                      1 1 371 372 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        373                      1 1 372 373 0=58
ReLU             374                      1 1 373 374 0=1.000000e-01
ConvolutionDepthWise 375                      1 1 374 375 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        376                      1 1 375 376 0=58
Convolution      377                      1 1 376 377 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        378                      1 1 377 378 0=58
ReLU             379                      1 1 378 379 0=1.000000e-01
Concat           380                      2 1 370 379 380 0=0
ShuffleChannel   385                      1 1 380 385 0=2 1=0
Slice            386                      1 2 385 386 387 -23300=2,58,-233 1=0
Convolution      388                      1 1 387 388 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        389                      1 1 388 389 0=58
ReLU             390                      1 1 389 390 0=1.000000e-01
ConvolutionDepthWise 391                      1 1 390 391 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        392                      1 1 391 392 0=58
Convolution      393                      1 1 392 393 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        394                      1 1 393 394 0=58
ReLU             395                      1 1 394 395 0=1.000000e-01
Concat           396                      2 1 386 395 396 0=0
ShuffleChannel   401                      1 1 396 401 0=2 1=0
Slice            402                      1 2 401 402 403 -23300=2,58,-233 1=0
Convolution      404                      1 1 403 404 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        405                      1 1 404 405 0=58
ReLU             406                      1 1 405 406 0=1.000000e-01
ConvolutionDepthWise 407                      1 1 406 407 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        408                      1 1 407 408 0=58
Convolution      409                      1 1 408 409 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        410                      1 1 409 410 0=58
ReLU             411                      1 1 410 411 0=1.000000e-01
Concat           412                      2 1 402 411 412 0=0
ShuffleChannel   417                      1 1 412 417 0=2 1=0
Split            splitncnn_1              1 2 417 417_splitncnn_0 417_splitncnn_1
ConvolutionDepthWise 418                      1 1 417_splitncnn_1 418 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        419                      1 1 418 419 0=116
Convolution      420                      1 1 419 420 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        421                      1 1 420 421 0=116
ReLU             422                      1 1 421 422 0=1.000000e-01
Convolution      423                      1 1 417_splitncnn_0 423 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        424                      1 1 423 424 0=116
ReLU             425                      1 1 424 425 0=1.000000e-01
ConvolutionDepthWise 426                      1 1 425 426 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        427                      1 1 426 427 0=116
Convolution      428                      1 1 427 428 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        429                      1 1 428 429 0=116
ReLU             430                      1 1 429 430 0=1.000000e-01
Concat           431                      2 1 422 430 431 0=0
ShuffleChannel   436                      1 1 431 436 0=2 1=0
Slice            437                      1 2 436 437 438 -23300=2,116,-233 1=0
Convolution      439                      1 1 438 439 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        440                      1 1 439 440 0=116
ReLU             441                      1 1 440 441 0=1.000000e-01
ConvolutionDepthWise 442                      1 1 441 442 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        443                      1 1 442 443 0=116
Convolution      444                      1 1 443 444 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        445                      1 1 444 445 0=116
ReLU             446                      1 1 445 446 0=1.000000e-01
Concat           447                      2 1 437 446 447 0=0
ShuffleChannel   452                      1 1 447 452 0=2 1=0
Slice            453                      1 2 452 453 454 -23300=2,116,-233 1=0
Convolution      455                      1 1 454 455 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        456                      1 1 455 456 0=116
ReLU             457                      1 1 456 457 0=1.000000e-01
ConvolutionDepthWise 458                      1 1 457 458 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        459                      1 1 458 459 0=116
Convolution      460                      1 1 459 460 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        461                      1 1 460 461 0=116
ReLU             462                      1 1 461 462 0=1.000000e-01
Concat           463                      2 1 453 462 463 0=0
ShuffleChannel   468                      1 1 463 468 0=2 1=0
Slice            469                      1 2 468 469 470 -23300=2,116,-233 1=0
Convolution      471                      1 1 470 471 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        472                      1 1 471 472 0=116
ReLU             473                      1 1 472 473 0=1.000000e-01
ConvolutionDepthWise 474                      1 1 473 474 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        475                      1 1 474 475 0=116
Convolution      476                      1 1 475 476 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        477                      1 1 476 477 0=116
ReLU             478                      1 1 477 478 0=1.000000e-01
Concat           479                      2 1 469 478 479 0=0
ShuffleChannel   484                      1 1 479 484 0=2 1=0
Slice            485                      1 2 484 485 486 -23300=2,116,-233 1=0
Convolution      487                      1 1 486 487 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        488                      1 1 487 488 0=116
ReLU             489                      1 1 488 489 0=1.000000e-01
ConvolutionDepthWise 490                      1 1 489 490 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        491                      1 1 490 491 0=116
Convolution      492                      1 1 491 492 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        493                      1 1 492 493 0=116
ReLU             494                      1 1 493 494 0=1.000000e-01
Concat           495                      2 1 485 494 495 0=0
ShuffleChannel   500                      1 1 495 500 0=2 1=0
Slice            501                      1 2 500 501 502 -23300=2,116,-233 1=0
Convolution      503                      1 1 502 503 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        504                      1 1 503 504 0=116
ReLU             505                      1 1 504 505 0=1.000000e-01
ConvolutionDepthWise 506                      1 1 505 506 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        507                      1 1 506 507 0=116
Convolution      508                      1 1 507 508 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        509                      1 1 508 509 0=116
ReLU             510                      1 1 509 510 0=1.000000e-01
Concat           511                      2 1 501 510 511 0=0
ShuffleChannel   516                      1 1 511 516 0=2 1=0
Slice            517                      1 2 516 517 518 -23300=2,116,-233 1=0
Convolution      519                      1 1 518 519 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        520                      1 1 519 520 0=116
ReLU             521                      1 1 520 521 0=1.000000e-01
ConvolutionDepthWise 522                      1 1 521 522 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        523                      1 1 522 523 0=116
Convolution      524                      1 1 523 524 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        525                      1 1 524 525 0=116
ReLU             526                      1 1 525 526 0=1.000000e-01
Concat           527                      2 1 517 526 527 0=0
ShuffleChannel   532                      1 1 527 532 0=2 1=0
Slice            533                      1 2 532 533 534 -23300=2,116,-233 1=0
Convolution      535                      1 1 534 535 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        536                      1 1 535 536 0=116
ReLU             537                      1 1 536 537 0=1.000000e-01
ConvolutionDepthWise 538                      1 1 537 538 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        539                      1 1 538 539 0=116
Convolution      540                      1 1 539 540 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        541                      1 1 540 541 0=116
ReLU             542                      1 1 541 542 0=1.000000e-01
Concat           543                      2 1 533 542 543 0=0
ShuffleChannel   548                      1 1 543 548 0=2 1=0
Split            splitncnn_2              1 2 548 548_splitncnn_0 548_splitncnn_1
ConvolutionDepthWise 549                      1 1 548_splitncnn_1 549 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        550                      1 1 549 550 0=232
Convolution      551                      1 1 550 551 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        552                      1 1 551 552 0=232
ReLU             553                      1 1 552 553 0=1.000000e-01
Convolution      554                      1 1 548_splitncnn_0 554 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        555                      1 1 554 555 0=232
ReLU             556                      1 1 555 556 0=1.000000e-01
ConvolutionDepthWise 557                      1 1 556 557 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        558                      1 1 557 558 0=232
Convolution      559                      1 1 558 559 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        560                      1 1 559 560 0=232
ReLU             561                      1 1 560 561 0=1.000000e-01
Concat           562                      2 1 553 561 562 0=0
ShuffleChannel   567                      1 1 562 567 0=2 1=0
Slice            568                      1 2 567 568 569 -23300=2,232,-233 1=0
Convolution      570                      1 1 569 570 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        571                      1 1 570 571 0=232
ReLU             572                      1 1 571 572 0=1.000000e-01
ConvolutionDepthWise 573                      1 1 572 573 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        574                      1 1 573 574 0=232
Convolution      575                      1 1 574 575 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        576                      1 1 575 576 0=232
ReLU             577                      1 1 576 577 0=1.000000e-01
Concat           578                      2 1 568 577 578 0=0
ShuffleChannel   583                      1 1 578 583 0=2 1=0
Slice            584                      1 2 583 584 585 -23300=2,232,-233 1=0
Convolution      586                      1 1 585 586 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        587                      1 1 586 587 0=232
ReLU             588                      1 1 587 588 0=1.000000e-01
ConvolutionDepthWise 589                      1 1 588 589 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        590                      1 1 589 590 0=232
Convolution      591                      1 1 590 591 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        592                      1 1 591 592 0=232
ReLU             593                      1 1 592 593 0=1.000000e-01
Concat           594                      2 1 584 593 594 0=0
ShuffleChannel   599                      1 1 594 599 0=2 1=0
Slice            600                      1 2 599 600 601 -23300=2,232,-233 1=0
Convolution      602                      1 1 601 602 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        603                      1 1 602 603 0=232
ReLU             604                      1 1 603 604 0=1.000000e-01
ConvolutionDepthWise 605                      1 1 604 605 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        606                      1 1 605 606 0=232
Convolution      607                      1 1 606 607 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        608                      1 1 607 608 0=232
ReLU             609                      1 1 608 609 0=1.000000e-01
Concat           610                      2 1 600 609 610 0=0
ShuffleChannel   615                      1 1 610 615 0=2 1=0
Deconvolution    616                      1 1 615 616 0=96 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=712704
BatchNorm        617                      1 1 616 617 0=96
ReLU             618                      1 1 617 618
Deconvolution    619                      1 1 618 619 0=96 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
BatchNorm        620                      1 1 619 620 0=96
ReLU             621                      1 1 620 621
Interp           645                      1 1 621 645 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Convolution      output                   1 1 645 output 0=15 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1440
